supperthomas/rt-thread/bsp/nrf5x/nrf5340/packages/nrfx-latest/libuarte/nrf_libuarte_async.c
        /*lint -save -e666 */
        //PPI_CH_SETUP(p_libuarte->p_ctrl_blk->ppi_channels[NRF_LIBUARTE_ASYNC_PPI_CH_RXRDY_CLEAR],
        //             nrf_uarte_event_address_get(p_libuarte->p_libuarte->uarte, NRF_UARTE_EVENT_RXDRDY),
        //             tmr_start_tsk,
        //             tmr_clear_tsk);
        nrf_uarte_publish_set(p_libuarte->p_libuarte->uarte,NRF_UARTE_EVENT_RXDRDY,p_libuarte->p_ctrl_blk->ppi_channels[NRF_LIBUARTE_ASYNC_PPI_CH_RXRDY_CLEAR]);
        nrf_rtc_subscribe_set(p_libuarte->p_rtc->p_reg,NRF_RTC_TASK_START,p_libuarte->p_ctrl_blk->ppi_channels[NRF_LIBUARTE_ASYNC_PPI_CH_RXRDY_CLEAR]);
        nrf_rtc_subscribe_set(p_libuarte->p_rtc->p_reg,NRF_RTC_TASK_CLEAR,p_libuarte->p_ctrl_blk->ppi_channels[NRF_LIBUARTE_ASYNC_PPI_CH_RXRDY_CLEAR]);
        nrf_timer_subscribe_set(p_libuarte->p_libuarte->timer.p_reg,NRF_TIMER_TASK_COUNT,p_libuarte->p_ctrl_blk->ppi_channels[NRF_LIBUARTE_ASYNC_PPI_CH_RXRDY_CLEAR]);
        //nrf_timer_subscribe_set();
        

        //PPI_CH_SETUP(p_libuarte->p_ctrl_blk->ppi_channels[NRF_LIBUARTE_ASYNC_PPI_CH_COMPARE_SHUTDOWN],
        //             tmr_compare_evt,
        //             tmr_stop_tsk,
        //             (uint32_t)&p_libuarte->p_libuarte->timer.p_reg->TASKS_CAPTURE[3]);
        nrf_rtc_publish_set(p_libuarte->p_rtc->p_reg,NRF_RTC_EVENT_COMPARE_0,p_libuarte->p_ctrl_blk->ppi_channels[NRF_LIBUARTE_ASYNC_PPI_CH_COMPARE_SHUTDOWN]);
        nrf_rtc_subscribe_set(p_libuarte->p_rtc->p_reg,NRF_RTC_TASK_STOP,p_libuarte->p_ctrl_blk->ppi_channels[NRF_LIBUARTE_ASYNC_PPI_CH_COMPARE_SHUTDOWN]);
        nrf_timer_subscribe_set(p_libuarte->p_libuarte->timer.p_reg, NRF_TIMER_TASK_CAPTURE3, p_libuarte->p_ctrl_blk->ppi_channels[NRF_LIBUARTE_ASYNC_PPI_CH_COMPARE_SHUTDOWN]);
        /*lint -restore */
    }

    nrf_libuarte_drv_config_t uart_config = {
        .tx_pin        = p_config->tx_pin,
        .rx_pin        = p_config->rx_pin,
        .cts_pin       = p_config->cts_pin,
        .rts_pin       = p_config->rts_pin,
        .startrx_evt   = nrf_uarte_event_address_get(p_libuarte->p_libuarte->uarte, NRF_UARTE_EVENT_ENDRX),
        .endrx_evt     = 0,
        .rxstarted_tsk = 0,
        .rxdone_tsk    = 0,
        .hwfc          = p_config->hwfc,
        .parity        = p_config->parity,
        .baudrate      = p_config->baudrate,
        .irq_priority  = p_config->int_prio,
        .pullup_rx     = p_config->pullup_rx,
    };

    ret = nrf_libuarte_drv_init(p_libuarte->p_libuarte, &uart_config, uart_evt_handler, (void *)p_libuarte);
    if (ret != NRF_SUCCESS)
    {
        return ret;
    }

    ret = nrf_balloc_init(p_libuarte->p_rx_pool);
    if (ret != NRF_SUCCESS)
    {
        return ret;
    }

    nrf_queue_reset(p_libuarte->p_rx_queue);
    p_libuarte->p_ctrl_blk->enabled = true;

    return ret;
}

void nrf_libuarte_async_uninit(const nrf_libuarte_async_t * const p_libuarte)
{
    if (p_libuarte->p_ctrl_blk->enabled == false)
    {
        return;
    }

    p_libuarte->p_ctrl_blk->enabled = false;

    /* if HW timeout was used */
    if (p_libuarte->p_app_timer == NULL || !NRF_LIBUARTE_ASYNC_WITH_APP_TIMER)
    {
        uint32_t i;
        ret_code_t ret;
        for (i = 0; i < NRF_LIBUARTE_ASYNC_PPI_CH_MAX; i++)
        {
            ret = nrfx_dppi_channel_disable(p_libuarte->p_ctrl_blk->ppi_channels[i]);
            ASSERT(ret == NRF_SUCCESS)
            ret = nrfx_dppi_channel_free(p_libuarte->p_ctrl_blk->ppi_channels[i]);
            ASSERT(ret == NRF_SUCCESS)
        }
    }

    if (p_libuarte->p_rtc && RTC_IN_USE)
    {
        nrfx_rtc_disable(p_libuarte->p_rtc);
        nrfx_rtc_uninit(p_libuarte->p_rtc);
    }
    else if (p_libuarte->p_timer && TIMER_IN_USE)
    {
        nrfx_timer_disable(p_libuarte->p_timer);
        nrfx_timer_uninit(p_libuarte->p_timer);
    }
    else if (p_libuarte->p_app_timer && NRF_LIBUARTE_ASYNC_WITH_APP_TIMER)
    {
        UNUSED_RETURN_VALUE(local_app_timer_stop(*p_libuarte->p_app_timer));
    }

    nrf_libuarte_drv_uninit(p_libuarte->p_libuarte);
}

void nrf_libuarte_async_enable(const nrf_libuarte_async_t * const p_libuarte)
{
    uint8_t * p_data;
    p_data = nrf_balloc_alloc(p_libuarte->p_rx_pool);
    p_libuarte->p_ctrl_blk->alloc_cnt++;
    if (p_data == NULL)
    {
        APP_ERROR_CHECK_BOOL(false);
    }

    if (p_libuarte->p_rtc && RTC_IN_USE)
    {
        nrfx_rtc_counter_clear(p_libuarte->p_rtc);
    }
    else if (p_libuarte->p_timer && TIMER_IN_USE)
    {
        nrfx_timer_clear(p_libuarte->p_timer);
    }

    if (!(p_libuarte->p_app_timer && NRF_LIBUARTE_ASYNC_WITH_APP_TIMER))
    {
        nrfx_err_t err;

        err = nrfx_dppi_channel_enable(p_libuarte->p_ctrl_blk->ppi_channels[NRF_LIBUARTE_ASYNC_PPI_CH_RXRDY_CLEAR]);
        APP_ERROR_CHECK_BOOL(err == NRFX_SUCCESS);
        err = nrfx_dppi_channel_enable(p_libuarte->p_ctrl_blk->ppi_channels[NRF_LIBUARTE_ASYNC_PPI_CH_COMPARE_SHUTDOWN]);
        APP_ERROR_CHECK_BOOL(err == NRFX_SUCCESS);
        //nrfx_rtc_enable(p_libuarte->p_rtc);
    }

    p_libuarte->p_ctrl_blk->p_curr_rx_buf = p_data;
    ret_code_t ret =  nrf_libuarte_drv_rx_start(p_libuarte->p_libuarte, p_data, p_libuarte->rx_buf_size, false);
    APP_ERROR_CHECK_BOOL(ret == NRF_SUCCESS);

    if (p_libuarte->p_app_timer && NRF_LIBUARTE_ASYNC_WITH_APP_TIMER)
    {
        uint32_t ticks = app_timer_us_to_ticks(p_libuarte->p_ctrl_blk->timeout_us)/2;
        ticks = MAX(APP_TIMER_MIN_TIMEOUT_TICKS, ticks);
        UNUSED_RETURN_VALUE(local_app_timer_start(*p_libuarte->p_app_timer, ticks, (void *)p_libuarte));
    }
}

ret_code_t nrf_libuarte_async_tx(const nrf_libuarte_async_t * const p_libuarte, uint8_t * p_data, size_t length)
{
    return nrf_libuarte_drv_tx(p_libuarte->p_libuarte, p_data, length);
}

void nrf_libuarte_async_rx_free(const nrf_libuarte_async_t * const p_libuarte, uint8_t * p_data, size_t length)
{
    p_libuarte->p_ctrl_blk->rx_free_cnt += length;
    if (p_libuarte->p_ctrl_blk->rx_free_cnt == p_libuarte->rx_buf_size)
    {
        p_data -= (p_libuarte->p_ctrl_blk->rx_free_cnt - length);
        p_libuarte->p_ctrl_blk->rx_free_cnt = 0;
        nrf_balloc_free(p_libuarte->p_rx_pool, p_data);

        p_libuarte->p_ctrl_blk->alloc_cnt--;
        if (p_libuarte->p_ctrl_blk->alloc_cnt<0)
        {
            NRF_LOG_ERROR("Freeing more RX buffers than allocated.");
            APP_ERROR_CHECK_BOOL(false);
        }
        NRF_LOG_INFO("Freeing full buffer 0x%08X, %d, (currently allocated:%d).",p_data, length, p_libuarte->p_ctrl_blk->alloc_cnt);

        if (p_libuarte->p_ctrl_blk->rx_halted)
        {
            bool ret = rx_buffer_schedule(p_libuarte);
            ASSERT(ret);
            p_libuarte->p_ctrl_blk->rx_halted = false;
        }
    }
    else if (p_libuarte->p_ctrl_blk->rx_free_cnt > p_libuarte->rx_buf_size)
    {
        NRF_LOG_ERROR("Unexpected RX free input parameter.");
        APP_ERROR_CHECK_BOOL(false);
    }
    else
    {
        NRF_LOG_INFO("Freeing partial buffer: 0x%08X, length:%d", p_data, length);
    }

}

void nrf_libuarte_async_rts_clear(const nrf_libuarte_async_t * const p_libuarte)
{
    nrf_libuarte_drv_rts_clear(p_libuarte->p_libuarte);
}

void nrf_libuarte_async_rts_set(const nrf_libuarte_async_t * const p_libuarte)
{
    nrf_libuarte_drv_rts_set(p_libuarte->p_libuarte);
}
